<?php

namespace Tests\Unit\U01_Answer;

use PHPUnit\Framework\TestCase;

class U380RinyaKasaiTest extends TestCase
{
    //
    public function test_370_010_that_true_is_true(): void
    {
        $this->assertTrue(true);
    }

    // 実務課題 : 伊勢原市の林野火災注意報、林野火災警報の判定

    // getInput のデータを読んで、getOutput のデータを作成します。

    // ルール
    // 
    // 
    //
    // 2026/1/4 - 2026/1/31 の毎日の林野火災注意報、警報を判定する
    //
    // 【注意報】
    // ①前日までの3日間の合計降水量が1ｍｍ以下、かつ、前30日間の合計降水量が30ｍｍ以下である
    // ②前日までの3日間の合計降水量が1ｍｍ以下、かつ、気象庁が乾燥注意報を発表している
    // 　※毎朝5時の気象情報により、①②のうち、いずれかが観測された場合
    // 
    // 【警報】
    // ①前日までの3日間の合計降水量が1ｍｍ以下、かつ、前30日間の合計降水量が30ｍｍ以下である
    // ②前日までの3日間の合計降水量が1ｍｍ以下、かつ、気象庁が乾燥注意報を発表している
    // ③毎朝5時の気象情報により、上記①②のいずれかの気象条件に加え、強風注意報が発表された場合

    // 日付計算には、良いライブラリ(Carbon)があるのだが、まだ習っていないので、ここではまだ使わず単純計算にとどめておく。

    private function getInput(): array
    {
        return [
            #   日付       降水量(mm)    乾燥注意報   強風注意報
            [  '20251201',        0,          1,         1],
            [  '20251202',        0,          0,         0],
            [  '20251203',        1,          0,         0],
            [  '20251204',        1,          0,         0],
            [  '20251205',        1,          1,         0],
            [  '20251206',        0,          0,         1],
            [  '20251207',        0,          0,         0],
            [  '20251208',        0,          0,         0],
            [  '20251209',        1,          1,         0],
            [  '20251210',        1,          0,         0],
            [  '20251211',        1,          0,         1],
            [  '20251212',        0,          0,         0],
            [  '20251213',        0,          1,         0],
            [  '20251214',        0,          0,         0],
            [  '20251215',        1,          0,         0],
            [  '20251216',        1,          0,         1],
            [  '20251217',        1,          1,         0],
            [  '20251218',        0,          0,         0],
            [  '20251219',        0,          0,         0],
            [  '20251220',        0,          0,         0],
            [  '20251220',        1,          1,         1],
            [  '20251221',        1,          0,         0],
            [  '20251222',        1,          0,         0],
            [  '20251223',        0,          0,         0],
            [  '20251224',        0,          1,         0],
            [  '20251225',        0,          0,         1],
            [  '20251226',        1,          0,         0],
            [  '20251227',        1,          0,         0],
            [  '20251228',        0,          1,         0],
            [  '20251229',        0,          0,         0],
            [  '20251230',        0,          0,         1],
            [  '20260101',        1,          1,         0],
            [  '20260102',        1,          0,         0],
            [  '20260103',        1,          0,         0],
            [  '20260104',        0,          0,         1],
            [  '20260105',        0,          1,         0],
            [  '20260106',        0,          0,         0],
            [  '20260107',        1,          0,         0],
            [  '20260108',        1,          0,         0],
            [  '20260109',        1,          1,         1],
            [  '20260110',        0,          0,         0],
            [  '20260111',        0,          0,         0],
            [  '20260112',        0,          0,         0],
            [  '20260113',        1,          1,         0],
            [  '20260114',        1,          0,         1],
            [  '20260115',        1,          0,         0],
            [  '20260116',        0,          0,         0],
            [  '20260117',        0,          1,         0],
            [  '20260118',        0,          0,         0],
            [  '20260119',        1,          0,         1],
            [  '20260120',        1,          0,         0],
            [  '20260121',        1,          0,         0],
            [  '20260122',        0,          0,         0],
            [  '20260123',        0,          0,         1],
            [  '20260124',        0,          1,         0],
            [  '20260125',        1,          0,         0],
            [  '20260126',        1,          0,         0],
            [  '20260127',        1,          0,         0],
            [  '20260128',        0,          1,         1],
            [  '20260129',        0,          0,         0],
            [  '20260130',        0,          0,         0],
            [  '20260131',        1,          0,         0],
        ];
    }    
    // 浜松市で一番高齢化(65歳以上の人口の占める割合)の高い町名
    // 
    private function getOutput(): array
    {
        return [
            '20260107' => "林野火災注意報",
            '20260108' => "林野火災注意報",
            '20260113' => "林野火災注意報",
            '20260114' => "林野火災警報",
            '20260119' => "林野火災警報",
            '20260120' => "林野火災注意報",
            '20260125' => "林野火災注意報",
            '20260126' => "林野火災注意報",
            '20260131' => "林野火災注意報",
        ];
    }

    // じぶんでやってみよう
    // 2026/1/4 - 2026/1/31 の毎日の林野火災注意報、警報を判定する
    //
    // 【注意報】
    // ①前日までの3日間の合計降水量が1ｍｍ以下、かつ、前30日間の合計降水量が30ｍｍ以下である
    // ②前日までの3日間の合計降水量が1ｍｍ以下、かつ、気象庁が乾燥注意報を発表している
    // 　※毎朝5時の気象情報により、①②のうち、いずれかが観測された場合
    // 
    // 【警報】
    // ①前日までの3日間の合計降水量が1ｍｍ以下、かつ、前30日間の合計降水量が30ｍｍ以下である
    // ②前日までの3日間の合計降水量が1ｍｍ以下、かつ、気象庁が乾燥注意報を発表している
    // ③毎朝5時の気象情報により、上記①②のいずれかの気象条件に加え、強風注意報が発表された場合

    // 日付計算には、良いライブラリ(Carbon)があるのだが、まだ習っていないので、ここではまだ使わず単純計算にとどめておく。

    public function test_380_rinya_kasai(): void
    {
        // 元データを読み込む
        $weather_hists = $this->getInput();
        $warnings = [];

        // QUIZ

        // 日付計算
        for ($day = 5; $day <= 31; $day++) {
            $yyyymmdd_00 = sprintf("202601%02d", $day);     // 対象の日
            $yyyymmdd_01 = sprintf("202601%02d", $day - 1); // 1日前
            $yyyymmdd_04 = sprintf("202601%02d", $day - 4); // 4日前
            $yyyymmdd_31 = sprintf("202512%02d", $day);     // ３1日前

            $kousui_3days = 0;
            $kousui_30days = 0;
            $warn_kansou = 0;
            $warn_kyoufu = 0;

            // 前日までの3日間の合計降水量
            foreach ($weather_hists as $item) {
                [$_yyyymmdd, $_kousui, $_kansou, $_kyoufu] = $item;

                // 前日までの3日間の合計降水量を取得
                // 4日前から1日前だったら、3日間降水量に加算する
                if ($yyyymmdd_04 <= $_yyyymmdd && $_yyyymmdd <= $yyyymmdd_01) {
                    $kousui_3days += $_kousui;
                }

                // 前30日間の合計降水量を取得
                if ($yyyymmdd_31 <= $_yyyymmdd && $_yyyymmdd <= $yyyymmdd_01) {
                    $kousui_30days += $_kousui;
                }

                if ($_yyyymmdd == $yyyymmdd_00) {
                    $warn_kansou = $_kansou;
                    $warn_kyoufu = $_kyoufu;
                }
            }

            $warning = '';

            // 【注意報】
            // 　※毎朝5時の気象情報により、①②のうち、いずれかが観測された場合
            // ①前日までの3日間の合計降水量が1ｍｍ以下、かつ、前30日間の合計降水量が30ｍｍ以下である
            if ($kousui_3days <= 1 && $kousui_30days <= 30) {
                $warning = '林野火災注意報';
            }
            
            // ②前日までの3日間の合計降水量が1ｍｍ以下、かつ、気象庁が乾燥注意報を発表している
            if ($kousui_3days <= 1 && $warn_kansou) {
                $warning = '林野火災注意報';
            }

            // 【警報】
            // ③毎朝5時の気象情報により、上記①②のいずれかの気象条件に加え、強風注意報が発表された場合
            // ①前日までの3日間の合計降水量が1ｍｍ以下、かつ、前30日間の合計降水量が30ｍｍ以下である
            if ($warn_kyoufu) {
                if ($kousui_3days <= 1 && $kousui_30days <= 30) {
                    $warning = '林野火災警報';
                }

                // ②前日までの3日間の合計降水量が1ｍｍ以下、かつ、気象庁が乾燥注意報を発表している
                if ($kousui_3days <= 1 && $warn_kansou) {
                    $warning = '林野火災警報';
                }
            }

            // 注意報・警報を記録
            if ($warning) {
                $warnings[$yyyymmdd_00] = $warning;
            }

        }

        $actual = $warnings;

        // /QUIZ
        $expected = $this->getOutput();

        $this->assertSame($expected, $actual);
    }

}        
